# SystemZoneData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SystemZoneData Members
SystemZoneData Class Methods Properties See Also
---
The SystemZoneData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of a system-zone data domain class. |
| Dispose | (Inherited from GenericZoneDomainData.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from GenericZoneDomainData.) |
| ZoneEquipmentId | The id of the zone equipment related to the zone. |

# See Also
SystemZoneData Class
Autodesk.Revit.DB.Mechanical Namespace